# VIndex Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GridNode..::..VIndex Property
GridNode Structure See Also
---
The node's index along the V axis.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int VIndex { get; set; }
```

Visual Basic
---
```text
Public Property VIndex As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int VIndex {
	int get ();
	void set (int value);
}
```

# See Also
GridNode Structure
Autodesk.Revit.DB Namespace